/*
  ДЕДЛАЙНЫ РЕДАКТИРУЮТСЯ ТОЛЬКО ЗДЕСЬ.
  Чтобы добавить задачу, скопируй объект целиком и вставь его в массив.
  due: дата с часовым поясом, например "2026-11-02T23:59:00+03:00".
  links: ссылки на условие, репозиторий, методичку или полезные материалы.
  ПРИМЕРНЫЕ ДАТЫ НИЖЕ НУЖНО ЗАМЕНИТЬ НА РЕАЛЬНЫЕ.
*/
window.DEADLINES = [
  {
    id: 1,
    subject: "Алгоритмы и структуры данных",
    title: "лабораторная работа № 2",
    description: "6 баллов, защита на ближайших двух практиках",
    due: "2026-10-30T23:59:00+03:00",
    links: [
      { name: "ссылка на лабу", url: "https://sort-me.org/contest/677" },
    ],
    done: false
  },
  {
    id: 2,
    subject: "Алгоритмы и структуры данных",
    title: "коллоквиум командный №1 (очный)",
    description: "надо записать команду, ссылка будет в тгк аисд/дс. БАЛЛЫ КОМАНДНЫЕ. 17:10",
    due: "2026-11-12T17:10:00+03:00",
    links: [
      { name: "yonote", url: "https://dm-aisd.yonote.ru/share/itmo_aisd_colloquium" },
    ],
    done: false
  },
  {
    id: 3,
    subject: "Основы программирования",
    title: "лаба 3, нулевой дедлайн",
    description: "-",
    due: "2026-11-07T23:59:00+03:00",
    links: [
      { name: "гпт", url: "https://chatgpt.com/" },
    ],
    done: false
  }
];
